app/Controllers/Admin/RoleController.php

    public function index()
    {
        // Also count users per role for display
        $roles = $this->roleModel->db->table('roles r')
            ->select('r.*, COUNT(u.id) AS user_count')
            ->join('users u', 'u.role_id = r.id AND u.deleted_at IS NULL', 'left')
            ->groupBy('r.id')
            ->orderBy('r.id', 'ASC')
            ->get()->getResultArray();
---
SELECT `r`.*, COUNT(u.id) AS user_count
FROM `roles` `r`
LEFT JOIN `users` `u` ON `u`.`role_id` = `r`.`id` AND `u`.`deleted_at` IS NULL
GROUP BY `r`.`id`
ORDER BY `r`.`id` ASC