app/Controllers/Admin/TeacherManagementController.php

SELECT `u`.`id`, `u`.`name`, `u`.`email`, `u`.`created_at`, `u`.`profile_image`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
WHERE `r`.`name` = 'teacher'
AND `u`.`deleted_at` IS NULL
ORDER BY `u`.`name` ASC
---
    public function index()
    {
        $teachers = $this->userModel->db->table('users u')
            ->select('u.id, u.name, u.email, u.created_at, u.profile_image')
            ->join('roles r', 'r.id = u.role_id', 'left')
            ->where('r.name', 'teacher')
            ->where('u.deleted_at IS NULL')
            ->orderBy('u.name', 'ASC')
            ->get()->getResultArray();