app/Controllers/StudentManagementController.php

SELECT `u`.`id`, `u`.`name`, `u`.`email`, `u`.`student_id`, `u`.`course`, `u`.`year_level`, `u`.`section`, `u`.`created_at`, `u`.`profile_image`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
WHERE `r`.`name` = 'student'
AND `u`.`deleted_at` IS NULL
ORDER BY `u`.`name` ASC
---
    public function index()
    {
        // Only show student-role users in this management view
        $students = $this->userModel->db->table('users u')
            ->select('u.id, u.name, u.email, u.student_id, u.course, u.year_level, u.section, u.created_at, u.profile_image')
            ->join('roles r', 'r.id = u.role_id', 'left')
            ->where('r.name', 'student')
            ->where('u.deleted_at IS NULL')
            ->orderBy('u.name', 'ASC')
            ->get()->getResultArray();